; domain
(define (domain grid)
(:requirements :strips :constraints)
(:predicates (pred_10 ?v6 ?v3)
             (pred_9 ?v8 ?v13)
             (pred_1 ?v6 ?v13)
             (pred_2 ?v12 ?v6 )
	     (pred_4 ?v6)
             (pred_3 ?v2)
             (pred_8 ?v8)
             (pred_6 ?v13)
             (pred_7 ?v6)
             (pred_12 ?v8)
             (pred_5 ?v6)
             (pred_11 ))



(:action op_2
:parameters (?v11 ?v1 ?v10 ?v9)
:precondition (and (pred_3 ?v11) (pred_3 ?v1) (pred_8 ?v10) (pred_6 ?v9)
          (pred_10 ?v11 ?v1) (pred_9 ?v10 ?v9)
                   (pred_1 ?v1 ?v9) (pred_4 ?v11) 
                   (pred_7 ?v1) (pred_12 ?v10))
:effect (and  (pred_5 ?v1) (not (pred_7 ?v1))))


(:action op_4
:parameters (?v11 ?v4)
:precondition (and (pred_3 ?v11) (pred_3 ?v4)
               (pred_4 ?v11) (pred_10 ?v11 ?v4) (pred_5 ?v4))
:effect (and (pred_4 ?v4) (not (pred_4 ?v11))))

(:action op_3
:parameters (?v11 ?v10)
:precondition (and (pred_3 ?v11) (pred_8 ?v10) 
                  (pred_4 ?v11) (pred_2 ?v10 ?v11) (pred_11 ))
:effect (and (pred_12 ?v10)
   (not (pred_2 ?v10 ?v11)) (not (pred_11 ))))


(:action op_1
:parameters (?v11 ?v7 ?v5)
:precondition (and (pred_3 ?v11) (pred_8 ?v7) (pred_8 ?v5)
                  (pred_4 ?v11) (pred_12 ?v5) (pred_2 ?v7 ?v11))
:effect (and (pred_12 ?v7) (pred_2 ?v5 ?v11)
        (not (pred_12 ?v5)) (not (pred_2 ?v7 ?v11))))

(:action op_5
:parameters (?v11 ?v10)
:precondition (and (pred_3 ?v11) (pred_8 ?v10) 
                  (pred_4 ?v11) (pred_12 ?v10))
:effect (and (pred_11 ) (pred_2 ?v10 ?v11) (not (pred_12 ?v10)))))

; problem
(define (problem grid-5-5-2-3-3)
    (:domain grid)
    (:objects
    obj_03 obj_20 obj_02 obj_15 obj_13 obj_21 obj_01 obj_29 obj_23 obj_11 obj_16 obj_28 obj_14 obj_25 obj_10 obj_24 obj_06 obj_07 obj_17 obj_30 obj_26 obj_12 obj_18 obj_09 obj_19
    obj_27 obj_05
    obj_04 obj_22 obj_08
    )

    (:init
       (pred_11)

       (pred_3 obj_03)
       (pred_3 obj_20)
       (pred_3 obj_02)
       (pred_3 obj_15)
       (pred_3 obj_13)
       (pred_3 obj_21)
       (pred_3 obj_01)
       (pred_3 obj_29)
       (pred_3 obj_23)
       (pred_3 obj_11)
       (pred_3 obj_16)
       (pred_3 obj_28)
       (pred_3 obj_14)
       (pred_3 obj_25)
       (pred_3 obj_10)
       (pred_3 obj_24)
       (pred_3 obj_06)
       (pred_3 obj_07)
       (pred_3 obj_17)
       (pred_3 obj_30)
       (pred_3 obj_26)
       (pred_3 obj_12)
       (pred_3 obj_18)
       (pred_3 obj_09)
       (pred_3 obj_19)
       (pred_6 obj_27)
       (pred_6 obj_05)
       (pred_8 obj_04)
       (pred_8 obj_22)
       (pred_8 obj_08)

       (pred_10 obj_03 obj_21)
       (pred_10 obj_03 obj_20)
       (pred_10 obj_20 obj_01)
       (pred_10 obj_20 obj_02)
       (pred_10 obj_20 obj_03)
       (pred_10 obj_02 obj_29)
       (pred_10 obj_02 obj_15)
       (pred_10 obj_02 obj_20)
       (pred_10 obj_15 obj_23)
       (pred_10 obj_15 obj_13)
       (pred_10 obj_15 obj_02)
       (pred_10 obj_13 obj_11)
       (pred_10 obj_13 obj_15)
       (pred_10 obj_21 obj_16)
       (pred_10 obj_21 obj_01)
       (pred_10 obj_21 obj_03)
       (pred_10 obj_01 obj_28)
       (pred_10 obj_01 obj_29)
       (pred_10 obj_01 obj_20)
       (pred_10 obj_01 obj_21)
       (pred_10 obj_29 obj_14)
       (pred_10 obj_29 obj_23)
       (pred_10 obj_29 obj_02)
       (pred_10 obj_29 obj_01)
       (pred_10 obj_23 obj_25)
       (pred_10 obj_23 obj_11)
       (pred_10 obj_23 obj_15)
       (pred_10 obj_23 obj_29)
       (pred_10 obj_11 obj_10)
       (pred_10 obj_11 obj_13)
       (pred_10 obj_11 obj_23)
       (pred_10 obj_16 obj_24)
       (pred_10 obj_16 obj_28)
       (pred_10 obj_16 obj_21)
       (pred_10 obj_28 obj_06)
       (pred_10 obj_28 obj_14)
       (pred_10 obj_28 obj_01)
       (pred_10 obj_28 obj_16)
       (pred_10 obj_14 obj_07)
       (pred_10 obj_14 obj_25)
       (pred_10 obj_14 obj_29)
       (pred_10 obj_14 obj_28)
       (pred_10 obj_25 obj_17)
       (pred_10 obj_25 obj_10)
       (pred_10 obj_25 obj_23)
       (pred_10 obj_25 obj_14)
       (pred_10 obj_10 obj_30)
       (pred_10 obj_10 obj_11)
       (pred_10 obj_10 obj_25)
       (pred_10 obj_24 obj_26)
       (pred_10 obj_24 obj_06)
       (pred_10 obj_24 obj_16)
       (pred_10 obj_06 obj_12)
       (pred_10 obj_06 obj_07)
       (pred_10 obj_06 obj_28)
       (pred_10 obj_06 obj_24)
       (pred_10 obj_07 obj_18)
       (pred_10 obj_07 obj_17)
       (pred_10 obj_07 obj_14)
       (pred_10 obj_07 obj_06)
       (pred_10 obj_17 obj_09)
       (pred_10 obj_17 obj_30)
       (pred_10 obj_17 obj_25)
       (pred_10 obj_17 obj_07)
       (pred_10 obj_30 obj_19)
       (pred_10 obj_30 obj_10)
       (pred_10 obj_30 obj_17)
       (pred_10 obj_26 obj_12)
       (pred_10 obj_26 obj_24)
       (pred_10 obj_12 obj_18)
       (pred_10 obj_12 obj_06)
       (pred_10 obj_12 obj_26)
       (pred_10 obj_18 obj_09)
       (pred_10 obj_18 obj_07)
       (pred_10 obj_18 obj_12)
       (pred_10 obj_09 obj_19)
       (pred_10 obj_09 obj_17)
       (pred_10 obj_09 obj_18)
       (pred_10 obj_19 obj_30)
       (pred_10 obj_19 obj_09)
       (pred_7 obj_29)
       (pred_7 obj_19)
       (pred_7 obj_25)
       (pred_1  obj_29 obj_27)
       (pred_1  obj_19 obj_05)
       (pred_1  obj_25 obj_05)
       (pred_5 obj_03)
       (pred_5 obj_20)
       (pred_5 obj_02)
       (pred_5 obj_15)
       (pred_5 obj_13)
       (pred_5 obj_21)
       (pred_5 obj_01)
       (pred_5 obj_23)
       (pred_5 obj_11)
       (pred_5 obj_16)
       (pred_5 obj_28)
       (pred_5 obj_14)
       (pred_5 obj_10)
       (pred_5 obj_24)
       (pred_5 obj_06)
       (pred_5 obj_07)
       (pred_5 obj_17)
       (pred_5 obj_30)
       (pred_5 obj_26)
       (pred_5 obj_12)
       (pred_5 obj_18)
       (pred_5 obj_09)

       (pred_9  obj_04 obj_27)
       (pred_9  obj_22 obj_05)
       (pred_9  obj_08 obj_05)
       (pred_2 obj_04 obj_10)
       (pred_2 obj_22 obj_30)
       (pred_2 obj_08 obj_18)
       (pred_4 obj_13)
    )

    (:goal (and
       (pred_2 obj_08 obj_25)
    ))
(:constraints
  (always (not (pred_4 obj_07)))
)
)

; plan
1. (op_4 obj_13 obj_11)
   deleted: (pred_4 obj_13)
   added: (pred_4 obj_11)
   goals met: 0 of 1
2. (op_4 obj_11 obj_10)
   deleted: (pred_4 obj_11)
   added: (pred_4 obj_10)
   goals met: 0 of 1
3. (op_4 obj_10 obj_30)
   deleted: (pred_4 obj_10)
   added: (pred_4 obj_30)
   goals met: 0 of 1
4. (op_4 obj_30 obj_17)
   deleted: (pred_4 obj_30)
   added: (pred_4 obj_17)
   goals met: 0 of 1
5. (op_4 obj_17 obj_09)
   deleted: (pred_4 obj_17)
   added: (pred_4 obj_09)
   goals met: 0 of 1
6. (op_4 obj_09 obj_18)
   deleted: (pred_4 obj_09)
   added: (pred_4 obj_18)
   goals met: 0 of 1
7. (op_3 obj_18 obj_08)
   deleted: (pred_2 obj_08 obj_18) (pred_11)
   added: (pred_12 obj_08)
   goals met: 0 of 1
8. (op_4 obj_18 obj_09)
   deleted: (pred_4 obj_18)
   added: (pred_4 obj_09)
   goals met: 0 of 1
9. (op_4 obj_09 obj_17)
   deleted: (pred_4 obj_09)
   added: (pred_4 obj_17)
   goals met: 0 of 1
10. (op_2 obj_17 obj_25 obj_08 obj_05)
   deleted: (pred_7 obj_25)
   added: (pred_5 obj_25)
   goals met: 0 of 1
11. (op_4 obj_17 obj_25)
   deleted: (pred_4 obj_17)
   added: (pred_4 obj_25)
   goals met: 0 of 1
12. (op_5 obj_25 obj_08)
   deleted: (pred_12 obj_08)
   added: (pred_11) (pred_2 obj_08 obj_25)
   goals met: 1 of 1
